In [1]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [3]:
import seaborn as sns
iris = sns.load_dataset('iris')
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

Q1

In [5]:
# a

iris.groupby('species')[['sepal_length', 'sepal_width', 'petal_length', 'petal_width']].agg(['mean', 'std', 'describe'])

           sepal_length                                                     \
                   mean          std describe
           sepal_length sepal_length    count   mean       std  min    25%
species
setosa            5.006     0.352490     50.0  5.006  0.352490  4.3  4.800
versicolor        5.936     0.516171     50.0  5.936  0.516171  4.9  5.600
virginica         6.588     0.635880     50.0  6.588  0.635880  4.9  6.225

                           ... petal_width                              \
                           ...        mean         std describe
            50%  75%  max  ... petal_width petal_width    count   mean
species                    ...
setosa      5.0  5.2  5.8  ...       0.246    0.105386     50.0  0.246
versicolor  5.9  6.3  7.0  ...       1.326    0.197753     50.0  1.326
virginica   6.5  6.9  7.9  ...       2.026    0.274650     50.0  2.026



                 std  min  25%  50%  75%  max
species
setosa      0.105386  0.1  0.2  0.2  0.3  0.6
versicolor  0.197753  1.0  1.2  1.3  1.5  1.8
virginica   0.274650  1.4  1.8  2.0  2.3  2.5

[3 rows x 40 columns]

In [ ]:
# b

Q2

In [54]:
titanic = sns.load_dataset('titanic')
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [48]:
# a
titanic['age'].apply(lambda x: x<20

SyntaxError: unexpected EOF while parsing (<ipython-input-48-2ec2b7714be9>, line 2)

In [55]:
# b
titanic['age'].fillna(titanic.age.mean(), inplace=True)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [49]:
#c
titanic.groupby(['sex', 'class', 'embark_town'])['survived'].mean()

sex     class   embark_town
female  First   Cherbourg      0.976744
                Queenstown     1.000000
                Southampton    0.958333
        Second  Cherbourg      1.000000
                Queenstown     1.000000
                Southampton    0.910448
        Third   Cherbourg      0.652174
                Queenstown     0.727273
                Southampton    0.375000
male    First   Cherbourg      0.404762
                Queenstown     0.000000
                Southampton    0.354430
        Second  Cherbourg      0.200000
                Queenstown     0.000000
                Southampton    0.154639
        Third   Cherbourg      0.232558
                Queenstown     0.076923
                Southampton    0.128302
Name: survived, dtype: float64

In [60]:
#d

titanic['age']
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

age2 = pd.cut(titanic.age, bins, labels=labels)
titanic['age2'] = age2
titanic.groupby(['age2'])['survived'].mean()

age2
미성년자    0.424242
청년      0.334152
중년      0.423237
장년      0.355932
노년      0.200000
Name: survived, dtype: float64

In [ ]:
#e

Q3

In [63]:
Mile_Per_Gallon = sns.load_dataset('mpg')
Mile_Per_Gallon.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [ ]:
#a

Mile_Per_Gallon['']